<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Weather provider name
    |--------------------------------------------------------------------------
    |
    | Наименование поставщика погоды
    |
    */

    'name' => 'OpenMeteo',

    /*
    |--------------------------------------------------------------------------
    | API url
    |--------------------------------------------------------------------------
    |
    | URL по которому обращаться к API
    |
    */

    'api_url' => 'https://api.open-meteo.com/v1/forecast?hourly=temperature_2m',

    /*
    |--------------------------------------------------------------------------
    | Auth type
    |--------------------------------------------------------------------------
    |
    | Тип авторизации:
    | - none: без авторизации
    | - token: токен в заголовке
    | - key: ключ в теле запроса
    | - oauth: авторизация через oAuth
    | - user-agent: авторизация по заголовку User-Agent
    |
    */

    'auth_type' => 'none',

    /*
    |--------------------------------------------------------------------------
    | Request type
    |--------------------------------------------------------------------------
    |
    | Тип запроса к API:
    | - GET
    | - POST
    |
    */

    'request_type' => 'GET',

    /*
    |--------------------------------------------------------------------------
    | API key name
    |--------------------------------------------------------------------------
    |
    | Наименование ключа для передачи его в API
    |
    */

    'api_key_title' => false,

    /*
    |--------------------------------------------------------------------------
    | API Key
    |--------------------------------------------------------------------------
    |
    | Ключ для подключения к API
    |
    */

    'api_key' => false,

    /*
    |--------------------------------------------------------------------------
    | Identify by city name
    |--------------------------------------------------------------------------
    |
    | Поддержка API определения погоды по наименованию города:
    | - true: по наименованию
    | - false: по координатам (предварительно по наименованию будут определяться координаты города)
    |
    */

    'identify_by_city' => false,

    /*
    |--------------------------------------------------------------------------
    | Сity parameter name
    |--------------------------------------------------------------------------
    |
    | Наименование параметра тела запроса, в котором должно передаваться название города
    |
    */

    'param_city_name' => false,

    /*
    |--------------------------------------------------------------------------
    | coordinate parameter name
    |--------------------------------------------------------------------------
    |
    | Наименование параметров тела запроса, в котором должны передаваться долгота и широта
    |
    */
    'param_coord_name' => [
        'longitude' => 'longitude',
        'latitude' => 'latitude',
    ],

    /*
    |--------------------------------------------------------------------------
    | Response type
    |--------------------------------------------------------------------------
    |
    | Тип ответа от API:
    | - json
    | - xml
    | - csv
    |
    */
    'response_type' => 'json',

    /*
    |--------------------------------------------------------------------------
    | Response mapper
    |--------------------------------------------------------------------------
    |
    | Маппер данных в результате ответа от API.
    | Массив вложенности.
    |
    */
    'response_map' => [
        'hourly',
        'temperature_2m',
        0
    ],
];
