<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Weather provider name
    |--------------------------------------------------------------------------
    |
    | Наименование поставщика погоды
    |
    */

    'name' => 'Yandex',

    /*
    |--------------------------------------------------------------------------
    | API url
    |--------------------------------------------------------------------------
    |
    | URL по которому обращаться к API
    |
    */

    'api_url' => 'https://api.weather.yandex.ru/v2/forecast?extra=true',

    /*
    |--------------------------------------------------------------------------
    | Auth type
    |--------------------------------------------------------------------------
    |
    | Тип авторизации:
    | - none: без авторизации
    | - token: токен в заголовке
    | - key: ключ в теле запроса
    | - oauth: авторизация через oAuth
    | - user-agent: авторизация по заголовку User-Agent
    |
    */

    'auth_type' => 'token',

    /*
    |--------------------------------------------------------------------------
    | Request type
    |--------------------------------------------------------------------------
    |
    | Тип запроса к API:
    | - GET
    | - POST
    |
    */

    'request_type' => 'GET',

    /*
    |--------------------------------------------------------------------------
    | API key name
    |--------------------------------------------------------------------------
    |
    | Наименование ключа для передачи его в API
    |
    */

    'api_key_title' => 'X-Yandex-API-Key',

    /*
    |--------------------------------------------------------------------------
    | API Key
    |--------------------------------------------------------------------------
    |
    | Ключ для подключения к API
    |
    */

    'api_key' => 'f0bd85ba-ab0c-4509-9672-8edccec84bbc',

    /*
    |--------------------------------------------------------------------------
    | Identify by city name
    |--------------------------------------------------------------------------
    |
    | Поддержка API определения погоды по наименованию города:
    | - true: по наименованию
    | - false: по координатам (предварительно по наименованию будут определяться координаты города)
    |
    */

    'identify_by_city' => false,

    /*
    |--------------------------------------------------------------------------
    | Сity parameter name
    |--------------------------------------------------------------------------
    |
    | Наименование параметра тела запроса, в котором должно передаваться название города
    |
    */

    'param_city_name' => false,

    /*
    |--------------------------------------------------------------------------
    | coordinate parameter name
    |--------------------------------------------------------------------------
    |
    | Наименование параметров тела запроса, в котором должны передаваться долгота и широта
    |
    */
    'param_coord_name' => [
        'longitude' => 'lon',
        'latitude' => 'lat',
    ],

    /*
    |--------------------------------------------------------------------------
    | Response type
    |--------------------------------------------------------------------------
    |
    | Тип ответа от API:
    | - json
    | - xml
    | - csv
    |
    */
    'response_type' => 'json',

    /*
    |--------------------------------------------------------------------------
    | Response mapper
    |--------------------------------------------------------------------------
    |
    | Маппер данных в результате ответа от API.
    | Массив вложенности.
    |
    */
    'response_map' => [
        'yesterday',
        'temp'
    ],
];
